---
date: "2017-12-01T00:00:00Z"
title: Quagga
---

After having some interviews where I've been asked about routing on linux solutions, I've decided to playaround with Quagga.
As always, you can find all the info already on the internet. And in my case Brian Kletter had all the necessary info to setup the environment.
Here's the [link](https://www.brianlinkletter.com/build-custom-linux-router-image-unetlab-eve-ng-network-emulators/) on how to setup a linux server with quagga software. And [here](https://www.brianlinkletter.com/how-to-build-a-network-of-linux-routers-using-quagga/) the initial setup for quagga.

For this lab I've decided to get familiar with the syntax first and capabilities and then to test a quick ospf scenario.

After setting it up it looks like this:

```
quagga# sh ip ospf interface ens3
ens3 is up
  ifindex 2, MTU 1500 bytes, BW 0 Kbit <UP,BROADCAST,RUNNING,MULTICAST>
  Internet Address 192.168.1.254/24, Broadcast 192.168.1.255, Area 0.0.0.0
  MTU mismatch detection:enabled
  Router ID 192.168.1.254, Network Type POINTOPOINT, Cost: 10
  Transmit Delay is 1 sec, State Point-To-Point, Priority 1
  No designated router on this network
  No backup designated router on this network
  Multicast group memberships: OSPFAllRouters
  Timer intervals configured, Hello 10s, Dead 40s, Wait 40s, Retransmit 5
    Hello due in 5.011s
  Neighbor Count is 1, Adjacent neighbor count is 1
quagga# sh ip ospf nei

    Neighbor ID Pri State           Dead Time Address         Interface
   RXmtL RqstL DBsmL
3.3.3.3           1 Full/DROther      37.318s 192.168.1.1     ens3:192.168.1.254
       0     0     0
```

```
quagga# sh ip ro
Codes: K - kernel route, C - connected, S - static, R - RIP,
       O - OSPF, I - IS-IS, B - BGP, P - PIM, A - Babel,
       > - selected route, * - FIB route

O>* 3.3.3.3/32 [110/11] via 192.168.1.1, ens3, 00:07:28
O>* 10.10.23.0/24 [110/20] via 192.168.1.1, ens3, 00:07:28
C>* 127.0.0.0/8 is directly connected, lo
O   192.168.1.0/24 [110/10] is directly connected, ens3, 00:23:44
C>* 192.168.1.0/24 is directly connected, ens3
C>* 192.168.100.0/24 is directly connected, lo
O>* 192.168.100.1/32 [110/10] is directly connected, lo, 00:01:19
```


```
R3#sh ip ro ospf
...
      192.168.100.0/32 is subnetted, 1 subnets
O IA     192.168.100.1 [110/20] via 192.168.1.254, 00:00:42, Ethernet0/0
```

Also, a really good tutorial can be found [here](https://openmaniak.com/quagga.php). 
As a final note I think that this is not that hard to configure if you have some basic unix knowledge, and I'm pleasantly surprised to see that ctrl+z has the same behaviour like on Cisco devices and it doesn't stops the vtysh process, like a normal shell would do :)


Today is Romania's National Day, so happy aniversary to all my Romanian folks wherever they may be now.
